Revit 2027 API
ScheduleDefinition.ClearFilters Method
 Removes all filters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearFilters()
Public Sub ClearFilters
public:
void ClearFilters()
member ClearFilters : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This ScheduleDefinition does not support filters.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace